app/Controllers/CarritoController.php

SELECT *
FROM `carritos`
WHERE `carritos`.`id_carrito` = 13
---
        $carrito = $this->carritoModel->getCarritoByUsuario($usuario_id);
        if (!$carrito) {
            $carrito_id = $this->carritoModel->crearCarrito($usuario_id);
            $carrito = $this->carritoModel->find($carrito_id);