app/Controllers/CarritoController.php

    public function actualizarCantidad($item_id)
    {
        $cantidad = $this->request->getPost('cantidad');
        $item = $this->carritoItemModel->find($item_id);

        if ($item) {
            $producto = $this->productoModel->find($item['producto_id']);
---
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '34'