app/Controllers/CheckoutController.php

INSERT INTO `ventas` (`usuario_id`, `fecha_venta`, `estado`, `total`, `id_direccion_envio`, `fecha_actualizacion`) VALUES ('22', '2025-06-18 22:30:09', 'pendiente', 827.58, 0, '2025-06-18 22:30:09')
---
        $db->transBegin();
        try {
            // 1. Crear venta
            $venta_id = $this->ventaModel->insert([
                'usuario_id' => $usuario_id,
                'fecha_venta' => date('Y-m-d H:i:s'),
                'estado' => 'pendiente',
                'total' => $total,
                'id_direccion_envio' => 0 // temporal, se actualiza luego
            ], true);

UPDATE `ventas` SET `id_direccion_envio` = 0, `fecha_actualizacion` = '2025-06-18 22:30:09'
WHERE `ventas`.`id_venta` IN (36)
INSERT INTO `venta_items` (`venta_id`, `producto_id`, `cantidad`, `precio_unitario`) VALUES (36, '34', '1', '679.00')
UPDATE `productos` SET `stock` = 5
WHERE `productos`.`id_producto` IN ('34')
---
                'instrucciones_entrega' => ''
            ], true);
            // 3. Actualizar venta con id_direccion_envio
            $this->ventaModel->update($venta_id, ['id_direccion_envio' => $id_direccion_envio]);
            // 4. Crear venta_items y actualizar stock
            foreach ($items as $item) {
                $producto = $this->productoModel->find($item['producto_id']);
                $this->ventaItemModel->insert([
                    'venta_id' => $venta_id,
                    'producto_id' => $item['producto_id'],
                    'cantidad' => $item['cantidad'],
                    'precio_unitario' => $producto['precio']
                ]);
                // Actualizar stock
                $nuevo_stock = $producto['stock'] - $item['cantidad'];
                $this->productoModel->update($item['producto_id'], ['stock' => $nuevo_stock]);

INSERT INTO `pagos` (`venta_id`, `monto`, `metodo_pago`, `estado`, `fecha_pago`, `comprobante`, `referencia_pago`) VALUES (36, 827.58, 'Bitcoin', 'exitoso', '2025-06-18 22:30:09', NULL, NULL)
UPDATE `ventas` SET `estado` = 'pagado', `fecha_actualizacion` = '2025-06-18 22:30:09'
WHERE `ventas`.`id_venta` IN (36)
INSERT INTO `historico_ventas` (`venta_id`, `estado_anterior`, `estado_nuevo`, `accion`, `usuario_id`, `fecha`) VALUES (36, 'pendiente', 'pagado', 'Compra realizada', '22', '2025-06-18 22:30:09')
DELETE FROM `carrito_items`
WHERE `carrito_id` = '1'
---
            } elseif ($metodo_pago === 'Transferencia') {
                $pago_data['referencia_pago'] = $this->request->getPost('referencia_pago');
            }
            $this->pagoModel->insert($pago_data);
            // 6. Actualizar estado venta
            $this->ventaModel->update($venta_id, ['estado' => 'pagado']);
            // 7. Registrar en historial
            $this->historicoVentaModel->insert([
                'venta_id' => $venta_id,
                'estado_anterior' => 'pendiente',
                'estado_nuevo' => 'pagado',
                'accion' => 'Compra realizada',
                'usuario_id' => $usuario_id,
                'fecha' => date('Y-m-d H:i:s')
            ]);
            // 8. Vaciar carrito
            $this->carritoItemModel->where('carrito_id', $carrito['id_carrito'])->delete();