app/Controllers/ConsultaController.php

SELECT *
FROM `consultas`
WHERE `consultas`.`id_consulta` = '14'
---
    public function detalleConsulta($id_consulta)
    {
        if (session()->get('rol') !== 'admin') {
            return redirect()->to('denegado');
        }

        $consulta = $this->consultaModel->find($id_consulta);