app/Controllers/PanelController.php

SELECT *
FROM `ventas`
WHERE DATE(fecha_venta) = '2025-06-20'
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `activo` = 1
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `rol` = 'cliente'
SELECT `ventas`.*, `personas`.`nombre`, `personas`.`apellido`
FROM `ventas`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `ventas`.`usuario_id`
JOIN `personas` ON `personas`.`usuario_id` = `usuarios`.`id_usuario`
ORDER BY `fecha_venta` DESC
 LIMIT 5
---
    public function verPanel(): string
    {
        // Obtener datos para las métricas
        $hoy = date('Y-m-d');

        // Ventas de hoy
        $ventasHoy = $this->ventaModel->where('DATE(fecha_venta)', $hoy)
                      ->get()
                      ->getResultArray();

        $totalVentasHoy = array_reduce($ventasHoy, function($carry, $venta) {
            return $carry + $venta['total'];
        }, 0);

        // Total de productos activos
        $totalProductos = $this->productoModel->where('activo', 1)
                           ->countAllResults();

        // Total de clientes (usuarios con rol 'cliente')
        $totalClientes = $this->usuarioModel->where('rol', 'cliente')
                          ->countAllResults();

        // Últimas ventas (5 más recientes)
        $ultimasVentas = $this->ventaModel->select('ventas.*, personas.nombre, personas.apellido')
                          ->join('usuarios', 'usuarios.id_usuario = ventas.usuario_id')
                          ->join('personas', 'personas.usuario_id = usuarios.id_usuario')
                          ->orderBy('fecha_venta', 'DESC')
                          ->limit(5)
                          ->get()
                          ->getResultArray();

SELECT *
FROM `pagos`
WHERE `venta_id` = '56'
 LIMIT 1
---
        // Agregar método de pago real a cada venta
        $pagoModel = new PagoModel();
        foreach ($ultimasVentas as &$venta) {
            $pago = $pagoModel->where('venta_id', $venta['id_venta'])->first();

SELECT *
FROM `productos`
WHERE `stock` < 10
AND `stock` > 0
AND `activo` = 1
ORDER BY `stock` ASC
 LIMIT 3
SELECT `resenas`.*, `productos`.`nombre` as `producto_nombre`, `personas`.`nombre`, `personas`.`apellido`
FROM `resenas`
JOIN `productos` ON `productos`.`id_producto` = `resenas`.`producto_id`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `resenas`.`usuario_id`
JOIN `personas` ON `personas`.`usuario_id` = `usuarios`.`id_usuario`
ORDER BY `resenas`.`fecha` DESC
 LIMIT 2
---
        }

        // Productos con bajo stock (<10 unidades)
        $productosBajoStock = $this->productoModel
                               ->where('stock <', 10)
                               ->where('stock >', 0)
                               ->where('activo', 1)
                               ->orderBy('stock', 'ASC')
                               ->limit(3)
                               ->get()
                               ->getResultArray();

        // Últimas reseñas (2 más recientes)
        $ultimasResenas = $this->resenaModel->select('resenas.*, productos.nombre as producto_nombre, personas.nombre, personas.apellido')
                           ->join('productos', 'productos.id_producto = resenas.producto_id')
                           ->join('usuarios', 'usuarios.id_usuario = resenas.usuario_id')
                           ->join('personas', 'personas.usuario_id = usuarios.id_usuario')
                           ->orderBy('resenas.fecha', 'DESC')
                           ->limit(2)
                           ->get()
                           ->getResultArray();