app/Controllers/ProductoController.php

SELECT *
FROM `categorias`
SELECT *
FROM `productos`
---
    public function productos()
    {
        $productos = $this->productoModel->getProductosActivos();

        $data = [
            'titulo' => 'Productos',
            'productos' => $productos,
            'categorias' => $this->categoriaModel->findAll(),
            'marcas' => $this->productoModel->getMarcasUnicas()
        ];

SELECT *
FROM `categorias`
WHERE `categorias`.`id_categoria` = '8'
---
    public function detalle($producto_id)
    {
        $producto = $this->productoModel->getProductoActivo($producto_id);

        if (!$producto) {
            return redirect()->to('productos')->with('error', 'Producto no encontrado');
        }

        $categoria = $this->categoriaModel->find($producto['categoria_id']);

SELECT *
FROM `productos`
SELECT *
FROM `categorias`
---
    public function productosPorCategoria($categoria_id)
    {
        $productos = $this->productoModel->getProductosByCategoria($categoria_id);
        $categoria = $this->categoriaModel->find($categoria_id);

        $data = [
            'titulo' => 'Productos en categoría: ' . ($categoria ? $categoria['nombre'] : 'Desconocida'),
            'productos' => $productos,
            'categoria' => $categoria,
            'categorias' => $this->categoriaModel->findAll(),
            'marcas' => $this->productoModel->getMarcasUnicas()
        ];

SELECT *
FROM `categorias`
---
        }

        $productos = $builder->get()->getResultArray();
        $categorias = $this->categoriaModel->findAll();

SELECT *
FROM `categorias`
---
    public function agregarProducto()
    {
        // Verificar si el usuario es administrador
        if (session()->get('rol') !== 'admin') {
            return redirect()->to('/')->with('error', 'No tienes permisos para realizar esta acción');
        }

        // Cargar categorías para el formulario
        $categorias = $this->categoriaModel->findAll();

SELECT *
FROM `categorias`
---
    public function editarProducto($producto_id = null)
    {
        // Verificar si el usuario es administrador
        if (session()->get('rol') !== 'admin') {
            return redirect()->to('denegado')->with('error', 'No tienes permisos para realizar esta acción');
        }

        // Si no se proporciona ID, redirigir a la lista
        if (!$producto_id) {
            return redirect()->to('admin/productos/listar');
        }

        $producto = $this->productoModel->find($producto_id);
        $categorias = $this->categoriaModel->findAll();