app/Controllers/ProductoController.php

SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '70'
---
    public function actualizarProducto()
    {
        // Verificar si el usuario es administrador
        if (session()->get('rol') !== 'admin') {
            return redirect()->to('/')->with('error', 'No tienes permisos para realizar esta acción');
        }

        $producto_id = $this->request->getPost('producto_id');
        $producto = $this->productoModel->find($producto_id);