app/Controllers/ResenaController.php

SELECT *
FROM `productos`
SELECT *
FROM `usuarios`
---
    public function listar()
    {
        if (session()->get('rol') !== 'admin') {
            return redirect()->to('denegado')->with('error', 'No tienes permisos para realizar esta acción');
        }

        $filtros = [
            'producto_id' => $this->request->getGet('producto_id'),
            'usuario_id' => $this->request->getGet('usuario_id'),
            'calificacion' => $this->request->getGet('calificacion'),
            'desde' => $this->request->getGet('desde'),
            'hasta' => $this->request->getGet('hasta')
        ];

        $resenas = $this->resenaModel->getResenasConFiltros($filtros);

        $data = [
            'titulo' => 'Gestión de Reseñas',
            'resenas' => $resenas,
            'productos' => $this->productoModel->findAll(),
            'usuarios' => $this->usuarioModel->findAll(),