app/Controllers/UsuarioController.php

SELECT *
FROM `personas`
WHERE `usuario_id` = '17'
---

    // Actualizar datos personales si existen
    $db = \Config\Database::connect();
    $persona = $db->table('personas')->where('usuario_id', $usuario_id)->get()->getRowArray();

UPDATE `personas` SET `nombre` = 'God', `apellido` = 'Mode', `tipo_documento` = 'DNI', `documento` = '28877221K', `telefono` = '600222222'
WHERE `usuario_id` = '17'
UPDATE `usuarios` SET `username` = 'God', `email` = 'god@gmail.com', `rol` = 'admin'
WHERE `usuarios`.`id_usuario` IN ('17')
---
            'telefono' => $request->getPost('telefono'),
        ];

        $db->table('personas')
            ->where('usuario_id', $usuario_id)
            ->update($datosPersona);
    }

    // Actualizar usuario
    if ($this->usuarioModel->update($usuario_id, $datosActualizados)) {