app/Controllers/VentaController.php

    public function listar()
    {
        // Verificar si el usuario es administrador
        if (session()->get('rol') !== 'admin') {
            return redirect()->to('/')->with('error', 'No tienes permisos para realizar esta acción');
        }

        // Filtros
        $filtros = [
            'id' => $this->request->getGet('id'),
            'estado' => $this->request->getGet('estado'),
            'desde' => $this->request->getGet('desde'),
            'hasta' => $this->request->getGet('hasta')
        ];

        // Obtener todas las ventas sin paginación
        $ventas = $this->ventaModel->getVentasConFiltros($filtros);

        // Obtener información de clientes
        foreach ($ventas as &$venta) {
            $usuario = $this->usuarioModel->find($venta['usuario_id']);
            $persona = $this->usuarioModel->getPersona($venta['usuario_id']);

            $venta['nombre_cliente'] = $persona ? $persona['nombre'] . ' ' . $persona['apellido'] : $usuario['username'];
            $venta['metodo_pago'] = $this->pagoModel->where('venta_id', $venta['id_venta'])->first()['metodo_pago'] ?? null;
---
SELECT *
FROM `ventas`
WHERE `ventas`.`id_venta` = '7'
SELECT *
FROM `pagos`
WHERE `venta_id` = '35'
 LIMIT 1

    public function detalle($venta_id)
    {
        // Buscar la venta
        $venta = $this->ventaModel->find($venta_id);

        if (!$venta) {
            return redirect()->back()->with('error', 'Venta no encontrada.');
        }

        // Obtener items de la venta con información de productos
        $items = $this->ventaItemModel
            ->select('venta_items.*, productos.nombre, productos.marca, productos.imagen_url')
            ->join('productos', 'productos.id_producto = venta_items.producto_id')
            ->where('venta_id', $venta_id)
            ->findAll();

        // Obtener dirección de envío asociada a la venta
        $direccion = $this->direccionEnvioModel
            ->where('venta_id', $venta_id)
            ->first() ?? [];

        // Obtener información del cliente
        $usuario = $this->usuarioModel->find($venta['usuario_id']);
        $persona = $this->usuarioModel->getPersona($venta['usuario_id']);

        // Obtener historial de estados de la venta
        $historial = $this->historicoVentaModel
            ->where('venta_id', $venta_id)
            ->orderBy('fecha', 'DESC')
            ->findAll();
---
SELECT `venta_items`.*, `productos`.`nombre`, `productos`.`marca`, `productos`.`imagen_url`
FROM `venta_items`
JOIN `productos` ON `productos`.`id_producto` = `venta_items`.`producto_id`
WHERE `venta_id` = '7'
SELECT *
FROM `direccion_envio`
WHERE `venta_id` = '7'
 LIMIT 1
SELECT *
FROM `historico_ventas`
WHERE `venta_id` = '7'
ORDER BY `fecha` DESC