app/Models/CarritoItemModel.php

SELECT *
FROM `carrito_items`
WHERE `carrito_id` = '1'
---
    public function getItemsByCarrito($carrito_id)
    {
        return $this->where('carrito_id', $carrito_id)->findAll();

SELECT *
FROM `carrito_items`
WHERE `carrito_id` = '13'
AND `producto_id` = '4'
 LIMIT 1
INSERT INTO `carrito_items` (`carrito_id`, `producto_id`, `cantidad`) VALUES ('13', '4', '1')
---
    public function agregarProducto($carrito_id, $producto_id, $cantidad = 1)
    {
        $item = $this->where(['carrito_id' => $carrito_id, 'producto_id' => $producto_id])->first();

        if ($item) {
            return $this->update($item['id_item'], ['cantidad' => $item['cantidad'] + $cantidad]);
        } else {
            $data = [
                'carrito_id' => $carrito_id,
                'producto_id' => $producto_id,
                'cantidad' => $cantidad
            ];
            return $this->insert($data);