app/Models/CarritoModel.php

    public function getCarritoByUsuario($usuario_id)
    {
        return $this->where('usuario_id', $usuario_id)->first();
---
SELECT *
FROM `carritos`
WHERE `usuario_id` = '22'
 LIMIT 1

    public function crearCarrito($usuario_id)
    {
        $data = [
            'usuario_id' => $usuario_id,
            'fecha_creacion' => date('Y-m-d H:i:s')
        ];
        return $this->insert($data);
---
INSERT INTO `carritos` (`usuario_id`, `fecha_creacion`) VALUES ('27', '2025-06-26 16:55:15')