app/Models/CategoriaModel.php

SELECT `categorias`.*, COUNT(productos.id_producto) as total_productos
FROM `categorias`
LEFT JOIN `productos` ON `productos`.`categoria_id` = `categorias`.`id_categoria`
GROUP BY `categorias`.`id_categoria`
---
    public function getCategoriasConProductos()
    {
        return $this->select('categorias.*, COUNT(productos.id_producto) as total_productos')
                   ->join('productos', 'productos.categoria_id = categorias.id_categoria AND productos.activo = 1', 'left')
                   ->groupBy('categorias.id_categoria')
                   ->findAll();

SELECT `id_categoria`, `nombre`, `descripcion`, `imagen_url`
FROM `categorias`
ORDER BY `nombre` ASC
---
    public function getCategoriasParaMostrar()
    {
        return $this->select('id_categoria, nombre, descripcion, imagen_url')
                    ->orderBy('nombre', 'ASC')
                    ->findAll();