app/Models/ConfiguracionModel.php

    public function getConfiguracion()
    {
        return $this->first();
---
SELECT *
FROM `configuracion`
 LIMIT 1