app/Models/DestacadosModel.php

SELECT `destacados`.*, `productos`.`precio`, `productos`.`nombre` as `producto_nombre`, `productos`.`marca`, `productos`.`modelo`
FROM `destacados`
JOIN `productos` ON `productos`.`id_producto` = `destacados`.`producto_id`
WHERE `destacados`.`activo` = 1
ORDER BY `destacados`.`orden` ASC
---
public function getDestacadosActivos()
{
    return $this->select('destacados.*, productos.precio, productos.nombre as producto_nombre, productos.marca, productos.modelo')
               ->join('productos', 'productos.id_producto = destacados.producto_id')
               ->where('destacados.activo', 1)
               ->orderBy('destacados.orden', 'ASC')
               ->findAll();