app/Models/PersonaModel.php

SELECT *
FROM `personas`
WHERE `usuario_id` = '22'
 LIMIT 1
---
    public function getPersonaByUsuario($usuario_id)
    {
        return $this->where('usuario_id', $usuario_id)->first();