app/Models/ProductoModel.php

SELECT *
FROM `productos`
WHERE `categoria_id` = '4'
AND `activo` = 1
---
    public function getProductosByCategoria($categoria_id)
    {
        return $this->where(['categoria_id' => $categoria_id, 'activo' => 1])->findAll();

SELECT *
FROM `productos`
WHERE `activo` = 1
ORDER BY `ventas_totales` DESC
 LIMIT 4
---
    public function getProductosMasVendidos($limit = 4)
    {
        return $this->where('activo', 1)
                ->orderBy('ventas_totales', 'DESC')
                ->limit($limit)
                ->findAll();