app/Models/UsuarioModel.php

SELECT `u`.*, `p`.`nombre`, `p`.`apellido`, `p`.`tipo_documento`, `p`.`documento`, `p`.`telefono`
FROM `usuarios` `u`
LEFT JOIN `personas` `p` ON `p`.`usuario_id` = `u`.`id_usuario`
---
public function getUsuariosConFiltros($filtros = [])
{
    $builder = $this->db->table('usuarios u');
    $builder->select('u.*, p.nombre, p.apellido, p.tipo_documento, p.documento, p.telefono');
    $builder->join('personas p', 'p.usuario_id = u.id_usuario', 'left');

    if (!empty($filtros['q'])) {
        $builder->groupStart()
            ->like('u.email', $filtros['q'])
            ->orLike('u.username', $filtros['q'])
            ->orLike('p.nombre', $filtros['q'])
            ->orLike('p.apellido', $filtros['q'])
            ->groupEnd();
    }

    if (!empty($filtros['rol'])) {
        $builder->where('u.rol', $filtros['rol']);
    }

    if (!empty($filtros['desde'])) {
        $builder->where('u.fecha_registro >=', $filtros['desde']);
    }

    return $builder->get()->getResultArray();

SELECT *
FROM `personas`
WHERE `usuario_id` = '17'
---
    public function getUsuarioCompleto($usuario_id)
    {
        $usuario = $this->find($usuario_id);
        if (!$usuario) {
            return null;
        }

        $db = \Config\Database::connect();
        $persona = $db->table('personas')->where('usuario_id', $usuario_id)->get()->getRowArray();

SELECT *
FROM `personas`
WHERE `usuario_id` = '3'
---
public function getPersona($usuario_id)
{
    $db = \Config\Database::connect();
    return $db->table('personas')->where('usuario_id', $usuario_id)->get()->getRowArray();