app/Models/VentaModel.php

SELECT `ventas`.*
FROM `ventas`
ORDER BY `fecha_venta` DESC
---
public function getVentasConFiltros($filtros = [])
{
    $builder = $this->select('ventas.*');

    if (!empty($filtros['id'])) {
        $builder->where('id_venta', $filtros['id']);
    }

    if (!empty($filtros['estado'])) {
        $builder->where('estado', $filtros['estado']);
    }

    if (!empty($filtros['desde'])) {
        $builder->where('fecha_venta >=', $filtros['desde'] . ' 00:00:00');
    }

    if (!empty($filtros['hasta'])) {
        $builder->where('fecha_venta <=', $filtros['hasta'] . ' 23:59:59');
    }

    // Cambiamos paginate por findAll para obtener todos los resultados
    return $builder->orderBy('fecha_venta', 'DESC')
                  ->findAll();