app/Views/nuevos_ingresos.php

SELECT *
FROM `productos`
WHERE `activo` = 1
ORDER BY `fecha_alta` DESC
 LIMIT 4
---
<?php
$productoModel = new \App\Models\ProductoModel();
$nuevosIngresos = $productoModel->where('activo', 1)
                               ->orderBy('fecha_alta', 'DESC')
                               ->limit(4)
                               ->findAll();